---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.UnableToCreateWallForPanel
source: html/174b80f9-9d46-f24d-6e8d-820b6f33c24e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.UnableToCreateWallForPanel Property

Unable to create wall for curtain wall panel.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToCreateWallForPanel { get; }
```